<h1 class="list-group-item list-group-item-action active" data-toggle="list"  role="tab" aria-controls="home"> Numpy, Pandas and Visualization Mini Project </h1>

<h5 class="list-group-item list-group-item-action active" >1. Create a dataframe like the below format </h5>



|Identifier|    |Date|  |Code_For_Name||Full_Name|
|----------|----|----|--|-----------|------|----------|
|1| |1979 [1978]|   |K. K.| |Mickéy Mousé|
|2| |1868|  |L., L. L.| |Donald Duck|
|218|   |1869|  |RemaÊ¿.||Mini Mouse|
|472|   |1851|  |A'BECKETT, Gilbert Abbott.||Donald Duck|
|5| |1857|  |ABATI, Francesco.||Pink Panther|


>###### 1.A) Clean the `date` column as shown in below format without using replace function.

                                    **Sample Input**

|Date|
|----|
|1979 [1978]| 
|1868|
|1869| 
|1851|
|1857|

                                    **Sample Ouput**

|Date|
|----|
|1979| 
|1868|
|1869| 
|1851|
|1857|


>###### 1.B) Clean the `Code_For_Name` column as shown in below format without using replace function.

                                    **Sample Input**

|Code_For_Name|
|----|
|K. K.| 
|L., L. L.|
|Rema¿.| 
|A'BECKETT, Gilbert Abbott.|
|ABATI, Francesco.|

                                    **Sample Ouput**

|Code_For_Name|
|----|
|KK| 
|LLL|
|Rema| 
|GilbertAbbottAbeckett|
|FrancescoAbati|


>###### 1.C) Clean the `Full_Name` column as shown in below format.

                                    **Sample Input**

|Full_Name|
|----|
|Mickéy Mousé| 
|Donald Duck|
|Mini Mouse| 
|Donald Duck|
|Pink Panther|

                                    **Sample Ouput**

|Firstname||Lastname|
|----|----|----|
|Micky| |Mous|
|Donald||Duck|
|Mini| |Mouse|
|Donald||Duck|
|Pink||Panther|

In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame
import matplotlib.pyplot as plt
import seaborn as sns
df1=DataFrame({'Identifier':[1,2,218,472,5],
               'Date':['1979 [1978]','1868','1869','1851','1857'],
               'Code_For_Name':['K. K.','L., L. L.','Rema¿.',"A'BECKETT, Gilbert Abbott.","ABATI, Francesco."],
               'Full_Name':['Mickéy Mousé','Donald Duck','Mini Mouse','Donald Duck','Pink Panther']})
df1

   Identifier         Date               Code_For_Name     Full_Name
0           1  1979 [1978]                       K. K.  Mickéy Mousé
1           2         1868                   L., L. L.   Donald Duck
2         218         1869                      Rema¿.    Mini Mouse
3         472         1851  A'BECKETT, Gilbert Abbott.   Donald Duck
4           5         1857           ABATI, Francesco.  Pink Panther

df1####  1.A) Clean the `date` column as shown in below format without using replace function.

In [2]:
l1=[int(i[:4]) if len(i)>4 else int(i) for i in np.array(df1['Date'])]
df1['Date']=l1
df1

   Identifier  Date               Code_For_Name     Full_Name
0           1  1979                       K. K.  Mickéy Mousé
1           2  1868                   L., L. L.   Donald Duck
2         218  1869                      Rema¿.    Mini Mouse
3         472  1851  A'BECKETT, Gilbert Abbott.   Donald Duck
4           5  1857           ABATI, Francesco.  Pink Panther

In [4]:
df1=DataFrame({'Identifier':[1,2,218,472,5],
               'Date':['1979 [1978]','1868','1869','1851','1857'],
               'Code_For_Name':['K. K.','L., L. L.','Rema¿.',"A'BECKETT, Gilbert Abbott.","ABATI, Francesco."],
               'Full_Name':['Mickéy Mousé','Donald Duck','Mini Mouse','Donald Duck','Pink Panther']})
l1=[]
for i in list(df1['Date'].values):
    if len(i)>4:
        i=int(i[:4])
        l1.append(i)
    else:
        i=int(i)
        l1.append(i)
df1['Date']=l1
df1

   Identifier  Date               Code_For_Name     Full_Name
0           1  1979                       K. K.  Mickéy Mousé
1           2  1868                   L., L. L.   Donald Duck
2         218  1869                      Rema¿.    Mini Mouse
3         472  1851  A'BECKETT, Gilbert Abbott.   Donald Duck
4           5  1857           ABATI, Francesco.  Pink Panther

###### 1.B) Clean the `Code_For_Name` column as shown in below format without using replace function.

In [ ]:
l1=[]
for i in list(df1['Code_For_Name'].values):
    if len(i.split(','))>1:
        j=i.split(',')[-1]+i.split(',')[-2].capitalize()
        name=''
        for k in j:
            if k.isalpha():
                name+=k
        l1.append(name)
    else:
        name=''
        for k in i:
            if k.isalpha():
                name+=k
        l1.append(name)
df1['Code_For_Name']=l1
df1

###### 1.C) Clean the `Full_Name` column as shown in below format.

In [ ]:
l1,l2=[],[]
for i in df1['Full_Name']:
    l1.append(i.split(' ')[0])
    l2.append(i.split(' ')[1])
df1.drop('Full_Name',axis=1,inplace=True)
df1['Firstname']=l1
df1['Lastname']=l2
df1

<h5 class="list-group-item list-group-item-action active" >2. Read the dataset called Menu_list_Carbohydrates.csv dataset </h5>

> #### Dataset Content:
This dataset provides a nutrition analysis of every menu item on the Bangalore's famous restaurant's menu, including breakfast, beef burgers, chicken etc..

> ##### A. Display the dataset of dimensions,datatype, statistic summary.

> ##### B. Which are the top 10 items that have the least Carbohydrates?

> ##### C. Which are the top 10 items that have the most Carbohydrates?

> ##### D. Display the bar graph for the frequncy of Categories of food items and write your observations.

> ##### E. An Indian male requires 2500 calories in a day and a female requires 2000 calories in a day to maintain good  

> #####    lifestyle. Find the solutions as displayed in sample output1 and 2.

        Sample Output1:

        * Average calories of 'Beverages' category is 796.67
        * On an Average 'Beverages' contributes to men's calories intake  0.32
        * On an Average 'Beverages' contributes to women's calories intake  0.4

        Sample Output2:

        * Average calories of 'Coffee & Tea' category is 323.33
        * Averagely 'Coffee & Tea' contributes to men's calories intake for  0.13
        * Averagely 'Coffee & Tea' contributes to women's calories intake for  0.16
        
        Steps to get the output1
        1. For each item of Beverages display calorie and calculate the contribution of that food item in the male and females's daily calorie need. 
        2. Calculate average calories for the beverages category
        3. Calculate average contribution of calorie for male's requirement using beverages category
        4. Calculate average contribution of calorie for female's requirement using beverages category
        
        Steps to get the output2
        1. For each item of 'Coffee & Tea' display calorie and calculate the contribution of that food item in the male and    females's daily calorie need. 
        2. Calculate average calories for the 'Coffee & Tea' category
        3. Calculate average contribution of calorie for male's requirement using 'Coffee & Tea' category
        4. Calculate average contribution of calorie for female's requirement using 'Coffee & Tea' category

> ##### F. If you order grilled chicken rather than crispy chicken, what is the change in calorie intake?

            Step1:  Display the suitable graph for the number of calories in Crispy Chicken category

            Step2: Find the average calories for Crispy Chicken Category

            Step3: Display the suitable graph for the number of calories in Grilled Chicken category

            Step4: Find the average calories for Grilled Chicken Category

            Step5: Get the final visual comparison of Crispy vs Grilled on the basis of calories

            Step6: Write your observations.
            
> ##### G. Plot scatter plot between carbohydrates and calories

In [ ]:
df2=pd.read_csv('Menu_list_Carbohydrates.csv')
print(df2.head())

#### A. Display the dataset of dimensions,datatype, statistic summary.

In [ ]:
print(df2.shape)
print(df2.dtypes)
print(df2.describe(include='all'))

#### B. Which are the top 10 items that have the least Carbohydrates?

In [ ]:
ar1=np.array(df2['Carbohydrates'])
ar1=np.sort(np.array(list(set(ar1))))
Lcarb=list(np.where(df2['Carbohydrates']<=25,[df2['Item_in_Menu'],df2['Carbohydrates']],'Nothing'))
Top10=[]
for k in ar1[:10]:
    for i,j in zip(Lcarb[0],Lcarb[1]):
        if k==j:
            Top10.append((i,j))
Top10=DataFrame(Top10,columns=['Item_in_Menu','Carbohydrates'])
Top10

In [ ]:
l1=list(set(df2['Carbohydrates'].values))
l1.sort()
l2=[]
for i,j in zip(df2['Item_in_Menu'].values,df2['Carbohydrates'].values):
    l2.append((i,j))
l3=[]

for j in l1[:10]:
    for i in range(len(l2)):
        if l2[i][1]==j:
            l3.append(l2[i])
l3=DataFrame(l3,columns=['Item_in_Menu','Carbohydrates'])
l3

#### C. Which are the top 10 items that have the most Carbohydrates?

In [ ]:
ar1=np.array(df2['Carbohydrates'])
ar1=np.sort(np.array(list(set(ar1))))
Lcarb=list(np.where(df2['Carbohydrates']>=67,[df2['Item_in_Menu'],df2['Carbohydrates']],'Nothing'))
Top10=[]
for k in ar1[-10:]:
    for i,j in zip(Lcarb[0],Lcarb[1]):
        if k==j:
            Top10.append((i,j))
Top10=DataFrame(Top10,columns=['Item_in_Menu','Carbohydrates'])
Top10

In [ ]:
l1=list(set(df2['Carbohydrates'].values))
l1.sort()
l2=[]
for i,j in zip(df2['Item_in_Menu'].values,df2['Carbohydrates'].values):
    l2.append((i,j))
l3=[]

for j in l1[-10:]:
    for i in range(len(l2)):
        if l2[i][1]==j:
            l3.append(l2[i])
l3=DataFrame(l3,columns=['Item_in_Menu','Carbohydrates'])
l3

#### D. Display the bar graph for frequncy of `Categories` of food items and write your observations.

In [ ]:
sns.barplot(data=df2,x='Item_in_Menu',y='Calories',hue='Category_Type')
plt.show()

In [ ]:
df2

#### E. An Indian male requires 2500 calories in a day and a female requires 2000 calories in a day to maintain good lifestyle. Find the solutions as displayed in sample output1 and 2.
    Sample Output1:

    * Average calories of 'Beverages' category is 796.67
    * On an Average 'Beverages' contributes to men's calories intake  0.32
    * On an Average 'Beverages' contributes to women's calories intake  0.4
    
    Steps to get the output1
    1. For each item of Beverages display calorie and calculate the contribution of that food item in the male and females's daily calorie need. 
    2. Calculate average calories for the beverages category
    3. Calculate average contribution of calorie for male's requirement using beverages category
    4. Calculate average contribution of calorie for female's requirement using beverages category

In [ ]:
l7=[]
l8=[]
for i,j in zip(df2['Category_Type'].values,df2['Calories']):
    if i=='Beverages':
        l7.append(i)
        l8.append(j)
print('Avg values of Beverages is:',sum(l8)/len(l8))
print("On an Average 'Beverages' contributes to men's calories intake:",796/2500)
print("On an Average 'Beverages' contributes to women's calories intake :",796/2000)

**Sample Output2**

* Average calories of 'Coffee & Tea' category is 323.33
* Averagely 'Coffee & Tea' contributes to men's calories intake for  0.13
* Averagely 'Coffee & Tea' contributes to women's calories intake for  0.16

    Steps to get the output2
    1. For each item of 'Coffee & Tea' display calorie and calculate the contribution of that food item in the male and    females's daily calorie need. 
    2. Calculate average calories for the 'Coffee & Tea' category
    3. Calculate average contribution of calorie for male's requirement using 'Coffee & Tea' category
    4. Calculate average contribution of calorie for female's requirement using 'Coffee & Tea' category

In [ ]:
l5=[]
l6=[]
for i,j in zip(df2['Category_Type'].values,df2['Calories']):
    if i=='Coffee & Tea':
        l5.append(i)
        l6.append(j)
print('Avg values of Coffee & Tea is:',sum(l6)/len(l6))
print("Averagely 'Coffee & Tea' contributes to men's calories intake for:",323/2500)
print("Averagely 'Coffee & Tea' contributes to women's calories intake for:",323/2000)

#### F. If you order grilled chicken rather than crispy chicken, what is the change in calorie intake?
        Step1:  Display the suitable graph for the number of calories in Crispy Chicken category

        Step2: Find the average calories for Crispy Chicken Category

        Step3: Display the suitable graph for the number of calories in Grilled Chicken category

        Step4: Find the average calories for Grilled Chicken Category

        Step5: Get the final visual comparison of Crispy vs Grilled on the basis of calories

        Step6: Write your observations.

##### Step1: Display the suitable graph for the number of calories in Crispy Chicken category

In [ ]:
l1=[]
l2=[]
for i,j in zip(df2['Item_in_Menu'].values,df2['Calories']):
    if i.find('Crispy Chicken')!=-1:
        l1.append(i)
        l2.append(j)
dfg=DataFrame({'Crispy':l1,'Value':l2})
plt.subplots(figsize=(30,10))
sns.barplot(x=l1, y=l2, data = dfg, )
plt.show()

##### Step2: Find the average calories for Crispy Chicken Category

In [ ]:
AvgofCrispyChicken=sum(l2)/len(l2)
AvgofCrispyChicken

##### Step3: Display the suitable graph for the number of calories in Grilled Chicken category

In [ ]:
l3=[]
l4=[]
for i,j in zip(df2['Item_in_Menu'].values,df2['Calories']):
    if i.find('Grilled Chicken')!=-1:
        l3.append(i)
        l4.append(j)
dfg=DataFrame({'Crispy':l1,'Value':l2})
plt.subplots(figsize=(30,10))
sns.barplot(x=l3, y=l4, data = dfg, )
plt.show()

##### Step4:Find the average calories for Grilled Chicken Category

In [ ]:
AvgofGrilledChicken=sum(l4)/len(l3)
AvgofGrilledChicken

##### Step 5: Get the final visual comparison of Crispy vs Grilled on the basis of calories

In [ ]:
l2.pop()
dfcg=DataFrame({'X':l2,'Y':l4})
dfcg.plot(kind='bar')
plt.show()

##### Step6: Write your observations

In [ ]:
print(f'If you order grilled chicken rather than crispy chicken then there is a difference in calories:{AvgofGrilledChicken-AvgofCrispyChicken}')

##### G. Plot scatter plot between carbohydrates and calories

In [ ]:
plt.scatter(df2['Carbohydrates'],df2['Calories'])
plt.show()